Examinator/src/InformationRegisters/ОценкиКачестваОбученияСУО/ОценкиКачестваОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОценкиКачестваОбученияСУО</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Оценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Выставлена</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаВыставления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ФотографииПользователейСУО/ФотографииПользователейСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ФотографииПользователейСУО</name>
  <resources>
    <name>ЕстьАватар</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Аватар</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ОценкиКачестваОбученияСУО/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция ОписаниеОценокПроведенияОбучения(Знач ПроведениеОбучения) Экспорт
	
	МассивОценок = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОценкиКачестваОбученияСУО.ПроведениеОбучения КАК ПроведениеОбучения,
		|	ОценкиКачестваОбученияСУО.Участник КАК Участник,
		|	ОценкиКачестваОбученияСУО.Участник.Наименование КАК НаименованиеУчастника,
		|	ОценкиКачестваОбученияСУО.Оценка КАК Оценка,
		|	ОценкиКачестваОбученияСУО.ДатаВыставления КАК ДатаВыставления,
		|	ОценкиКачестваОбученияСУО.Комментарий КАК Комментарий,
		|	ФотографииПользователейСУО.ЕстьАватар КАК ЕстьАватар
		|ИЗ
		|	РегистрСведений.ОценкиКачестваОбученияСУО КАК ОценкиКачестваОбученияСУО
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФотографииПользователейСУО КАК ФотографииПользователейСУО
		|		ПО ОценкиКачестваОбученияСУО.Участник = ФотографииПользователейСУО.Пользователь
		|ГДЕ
		|	ОценкиКачестваОбученияСУО.ПроведениеОбучения = &ПроведениеОбучения
		|	И ОценкиКачестваОбученияСУО.Выставлена = ИСТИНА";
	
	Запрос.УстановитьПараметр("ПроведениеОбучения", ПроведениеОбучения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтруктураОценки = Новый Структура();	
		
		ОписаниеПользователя = ВебКабинетСУО.ПользовательСтруктура(
			ВыборкаДетальныеЗаписи.Участник, ВыборкаДетальныеЗаписи.НаименованиеУчастника, ВыборкаДетальныеЗаписи.ЕстьАватар);
			
		СтруктураОценки.Вставить("Пользователь", ОписаниеПользователя);
		СтруктураОценки.Вставить("Оценка", ВыборкаДетальныеЗаписи.Оценка);
		СтруктураОценки.Вставить("Дата", ВыборкаДетальныеЗаписи.ДатаВыставления);
		СтруктураОценки.Вставить("Комментарий", ВыборкаДетальныеЗаписи.Комментарий);
		
		МассивОценок.Добавить(СтруктураОценки);
		
	КонецЦикла;
	
	Возврат МассивОценок;		
	
КонецФункции

Функция ОценкаЗаПроведениеОбучения(Знач ПроведениеОбучения) Экспорт
	
	ОписаниеОценки = Новый Структура("СредняяОценка, КоличествоОценок", 0, 0);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОценкиКачестваОбученияСУО.Оценка КАК Оценка
		|ИЗ
		|	РегистрСведений.ОценкиКачестваОбученияСУО КАК ОценкиКачестваОбученияСУО
		|ГДЕ
		|	ОценкиКачестваОбученияСУО.ПроведениеОбучения = &ПроведениеОбучения
		|	И ОценкиКачестваОбученияСУО.Выставлена = ИСТИНА";
	
	Запрос.УстановитьПараметр("ПроведениеОбучения", ПроведениеОбучения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	КоличествоОценок = 0;
	СуммаОценок = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Оценка) Тогда
			Продолжить;
		КонецЕсли;
		СуммаОценок = СуммаОценок + ВыборкаДетальныеЗаписи.Оценка;
		КоличествоОценок = КоличествоОценок + 1;
	КонецЦикла;
	
	Если КоличествоОценок > 0 Тогда
		ОписаниеОценки.КоличествоОценок = КоличествоОценок;
		ОписаниеОценки.СредняяОценка = Окр(СуммаОценок / КоличествоОценок, 1);
	КонецЕсли;
	
	Возврат ОписаниеОценки;
	
КонецФункции

#КонецОбласти

#КонецЕсли
